Repository: pekarskyi/ip-get-logger
Catalog: languages/ip-get-logger-*.po
Languages: uk

source: %s item
uk: %s запис

source: /wp-admin/ - Ignore requests to admin area
uk: /wp-admin/ - ігнорувати запити до адміністративної частини

source: /wp-content/ - Ignore requests to wp-content directory
uk: /wp-content/ - ігнорувати запити до каталогу wp-content

source: /wp-json/ - Ignore REST API requests
uk: /wp-json/ - ігнорувати запити REST API

source: 1 hour
uk: 1 год.

source: 1 minute
uk: 1 хв.

source: 10 minutes
uk: 10 хв.

source: 12 hours
uk: 12 год.

source: 24 hours
uk: 24 год.

source: 30 minutes
uk: 30 хв.

source: 5 minutes
uk: 5 хв.

source: 6 hours
uk: 6 год.

source: A GET request matching your database has been detected: {request}
uk: Було виявлено GET-запит, який відповідає шаблону: {request}

source: Actions
uk: Дії

source: Add Exclude Pattern
uk: Додати шаблон

source: Add New Exclude Pattern
uk: Додати новий шаблон

source: Add New Pattern
uk: Додати новий шаблон

source: Add Pattern
uk: Додати шаблон

source: All devices
uk: Всі пристрої

source: An error occurred while adding the exclude pattern
uk: Виникла помилка під час додавання шаблонів виключень

source: An error occurred while adding the pattern
uk: Виникла помилка під час додавання шаблону

source: An error occurred while clearing exclude patterns
uk: Виникла помилка під час очищення шаблонів виключень

source: An error occurred while clearing logs
uk: Виникла помилка при очищенні логів

source: An error occurred while clearing the list of patterns.
uk: Виникла помилка під час очищення списку шаблонів.

source: An error occurred while deleting the exclude pattern
uk: Виникла помилка під час видалення шаблонів виключень

source: An error occurred while deleting the pattern
uk: Виникла помилка під час видалення шаблону

source: An error occurred while editing the pattern
uk: Виникла помилка при редагуванні шаблону

source: An error occurred while exporting patterns
uk: Виникла помилка під час експорту шаблонів

source: An error occurred while importing patterns
uk: Виникла помилка під час імпорту шаблонів

source: An error occurred while updating exclude patterns
uk: Виникла помилка під час оновлення шаблонів виключень

source: An error occurred while updating the exclude pattern
uk: Виникла помилка під час оновлення шаблонів

source: An error occurred while updating the list of patterns from the repository!
uk: Виникла помилка при оновленні списку шаблонів з репозиторію

source: Are you sure you want to clear all exclude patterns?
uk: Ви впевнені, що хочете очистити всі шаблони виключень?

source: Are you sure you want to clear all logs?
uk: Ви впевнені, що хочете очистити всі логи?

source: Are you sure you want to clear the list of patterns?
uk: Ви впевнені, що хочете очистити список шаблонів?

source: Are you sure you want to delete this exclude pattern?
uk: Ви впевнені, що хочете видалити цей шаблон виключення?

source: Are you sure you want to delete this pattern?
uk: Ви впевнені, що хочете видалити цей шаблон?

source: Auto-cleanup logs (days)
uk: Автоочищення логів (днів)

source: Break it down into different variants (full URL, path, filename, etc.)
uk: Розділить його на різні варіанти (повна URL-адреса, шлях, ім'я файлу тощо).

source: Cancel
uk: Скасувати

source: Check each variant against all your patterns
uk: Перевірить кожен варіант на всіх ваших шаблонах

source: Clear All Exclude Patterns
uk: Очистити список

source: Clear exclude patterns:
uk: Очистити шаблони виключень:

source: Clear Logs
uk: Очистити логи

source: Clear Patterns
uk: Очистити список

source: Clear patterns:
uk: Очистити список шаблонів:

source: Clearing...
uk: Очищення...

source: Configure database parameters
uk: Налаштуйте параметри для роботи з базою даних

source: Configure email notifications for GET request matches
uk: Налаштування сповіщень на E-mail про збіги GET-запитів

source: Configure parameters for logging GET requests
uk: Налаштуйте параметри для логування GET-запитів

source: Country
uk: Країна

source: Country:
uk: Країна:

source: Database Information
uk: Інформація про базу даних

source: Database Settings
uk: Налаштування бази даних

source: Database Table
uk: Таблиця в базі даних

source: Database updated successfully: %d new patterns added, %d duplicates skipped.
uk: База успішно оновлена: додано %d нових шаблонів, пропущено %d дублікатів.

source: Date
uk: Дата

source: Date & Time
uk: Дата і час

source: Date:
uk: Дата:

source: Delete
uk: Видалити

source: Delete data when uninstalling the plugin
uk: Видалення даних при видаленні плагіна

source: Delete database table when uninstalling the plugin
uk: Видаляти таблицю з бази даних при видаленні плагіна

source: Device
uk: Пристрій

source: Device Type
uk: Тип пристрою

source: Device:
uk: Пристрій:

source: Edit
uk: Редагувати

source: Edit Exclude Pattern
uk: Редагувати шаблон виключення

source: Edit GET Pattern
uk: Редагувати шаблон

source: Email Message
uk: Текст повідомлення

source: Email Notifications
uk: Сповіщення на E-mail

source: Email Recipient
uk: Отримувач

source: Email Subject
uk: Тема листа

source: Email Throttle
uk: Затримка сповіщень

source: Empty response from GitHub
uk: Порожня відповідь від GitHub

source: Enter URL or request pattern
uk: Введіть URL або шаблон запиту

source: Enter URL pattern to exclude
uk: Введіть шаблон URL-адреси для виключення

source: Enter URL to test:
uk: Введіть URL для перевірки:

source: Error fetching remote data
uk: Помилка отримання віддалених даних

source: Exclude Pattern
uk: Шаблон виключення

source: Exclude pattern added successfully
uk: Шаблон виключення доданий успішно

source: Exclude pattern cannot be empty
uk: Шаблон виключення не може бути порожнім

source: Exclude pattern deleted successfully
uk: Шаблон виключення успішно видалено

source: Exclude pattern not found
uk: Не знайдено шаблон виключення

source: Exclude pattern updated successfully
uk: Шаблон виключення успішно оновлено

source: Exclude Patterns
uk: Виключення

source: Export
uk: Експортувати

source: Export patterns to file:
uk: Експортуйте шаблони у файл:

source: Failed to clear logs. Check file permissions.
uk: Не вдалося очистити журнали. Перевірте права доступу до файлів.

source: Failed to fetch data from GitHub. HTTP Response Code: %s
uk: Не вдалося отримати дані з GitHub. Код відповіді HTTP: %s

source: Failed to fetch data from GitHub: %s
uk: Не вдалося отримати дані з GitHub: %s

source: Failed to read file
uk: Не вдалося прочитати файл

source: File not found
uk: Файл не знайдено

source: Filter
uk: Фільтрувати

source: Filter by country
uk: Фільтр за країною

source: Filter by IP
uk: Фільтр за IP

source: Filter by URL
uk: Фільтр за URL

source: First page
uk: Перша

source: For example, if we set 5 minutes, and multiple suspicious requests are detected within a 5-minute period, only one email notification will be sent. The next notification can be sent only 5 minutes after the previous one.
uk: Наприклад, ми вказали 5 хв. Якщо на сайті буде виявлено кілька підозрілих запитів протягом 5-хвилинного періоду, буде відправлено лише одне email-сповіщення і наступне сповіщення може бути відправлено тільки через 5 хвилин після попереднього.

source: GET Requests Logs
uk: Логи GET-запитів

source: Help
uk: Довідка

source: HTML tags are supported, e.g., /?q=<iframe> or /?q=<script>
uk: Підтримуються HTML-теги, наприклад, /?q=<iframe> або /?q=<script></iframe>.

source: HTTP Host
uk: HTTP-хост

source: https://example.com/ or just example.com
uk: https://example.com/ або просто example.com

source: If you discover new malicious GET requests, please inform me so that I can add them to the patterns database.
uk: Якщо ви виявили нові шкідливі GET-запити, будь ласка, повідомте мене, щоб я міг додати їх до бази даних шаблонів.

source: Import
uk: Імпортувати

source: Import patterns from file (.txt):
uk: Імпорт шаблонів з файлу (.txt):

source: Imported %d pattern
uk: Імпортовано %d шаблон

source: Insufficient permissions
uk: Недостатньо прав

source: Insufficient permissions to perform this operation
uk: Недостатньо прав для виконання цієї операції

source: Invalid file
uk: Недопустимий файл

source: IP Address
uk: IP-адреса

source: IP GET Logger Settings
uk: Налаштування IP GET Logger

source: Last page
uk: Остання

source: Log Settings
uk: Налаштування логів

source: Logs cleared successfully
uk: Логи успішно очищено

source: Match Found
uk: Результат

source: Matched
uk: Відповідає

source: Matched Pattern
uk: Шаблон

source: Matching Patterns
uk: Відповідні шаблони

source: Method
uk: Метод

source: Next page
uk: Наступна

source: No data available
uk: Дані відсутні

source: No exclude patterns found in the repository.
uk: Відсутні шаблони для виключення.

source: No file uploaded
uk: Файл не завантажено

source: No limit (send all notifications)
uk: Без обмежень (надсилати всі сповіщення)

source: No matches found
uk: Збігів не знайдено

source: No patterns to export
uk: Немає шаблонів для експорту

source: No saved exclude patterns.
uk: Шаблони відсутні.

source: No saved logs.
uk: Немає збережених логів.

source: No saved patterns.
uk: Немає збережених шаблонів.

source: No valid exclude patterns found in the repository.
uk: Відсутні нові шаблони для виключення.

source: Not matched
uk: Не збігається

source: Note: Email notifications are throttled. You will not receive another notification for %d minutes.
uk: Примітка: для сповіщень на E-mail увімкнуто затримку. Ви не отримаєте наступне сповіщення протягом %d хвилин.

source: Number of patterns in Database
uk: Кількість шаблонів в базі

source: on Github - Issues - New issue
uk: на Github - Issues - New issue

source: Only .txt files are allowed
uk: Дозволені тільки файли з розширенням .txt

source: Parameter
uk: Параметр

source: Pattern
uk: Шаблон

source: Pattern added successfully
uk: Шаблон успішно додано

source: Pattern cannot be empty
uk: Шаблон не може бути порожнім

source: Pattern deleted successfully
uk: Шаблон успішно видалено

source: Pattern not found
uk: Шаблон не знайдено

source: Pattern updated successfully
uk: Шаблон успішно оновлено

source: Patterns
uk: Шаблони

source: patterns
uk: шаблони

source: Patterns with HTML Tags
uk: Шаблони з тегами HTML

source: Per Page:
uk: На сторінці:

source: Plugin for tracking GET requests to the site and logging them
uk: Плагін відстежує та логує спеціальні GET-запити до сайту

source: Plugin Information
uk: Інформація про плагін

source: Previous page
uk: Попередня

source: Report a new malicious pattern:
uk: Повідомте про новий шкідливий запит:

source: Request details:
uk: Деталі:

source: Request Method
uk: Метод запиту

source: Requests containing this pattern will be ignored and not logged.
uk: Запити, що містять цей шаблон, будуть ігноруватися і не реєструватися.

source: Reset Filters
uk: Скинути фільтри

source: Save
uk: Зберегти

source: Save Settings
uk: Зберегти налаштування

source: Search
uk: Пошук

source: Search patterns...
uk: Пошук...

source: Security error
uk: Помилка безпеки

source: Send email notifications when a request matches a pattern
uk: Надсилати сповіщення, якщо запит відповідає шаблону

source: send me an email:
uk: Email:

source: Send Notifications
uk: Надсилати сповіщення

source: Settings
uk: Налаштування

source: Settings saved successfully
uk: Налаштування успішно збережено

source: Show you which patterns matched and which variants were checked
uk: Покаже, які шаблони збіглися і які варіанти були перевірені

source: Specify the number of days to keep logs (0 - never delete)
uk: Вкажіть кількість днів для зберігання логів (0 - не видаляти)

source: Successfully added %d new exclude pattern from the repository.
uk: Успішно додано %d новий шаблон для виключення.

source: Suspicious request detected on your site
uk: На вашому сайті виявлено підозрілий запит

source: Test Results
uk: Результати тестування

source: Test URL
uk: Перевірити

source: Test with HTML tags (will add ?q=<iframe> to URL)
uk: Тестувати з тегами HTML

source: Tested URL
uk: Перевірена URL-адреса

source: The list of exclude patterns is successfully cleared.
uk: Список виключених шаблонів успішно очищено.

source: The list of patterns is successfully cleared.
uk: Список шаблонів успішно очищено.

source: The plugin does not track or collect anonymous data about websites, users, or requests.
uk: Плагін не відстежує і не збирає анонімні дані про веб-сайти, користувачів або запити.

source: These patterns in your database contain HTML tags:
uk: Ці шаблони у вашій базі даних містять HTML-теги:

source: This can help you troubleshoot why certain URLs are not being detected or logged.
uk: Це може допомогти вам з'ясувати, чому певні URL-адреси не виявляються або не реєструються.

source: This exclude pattern already exists
uk: Цей шаблон виключення вже існує

source: This pattern already exists in the database
uk: Цей шаблон вже існує в базі даних

source: This tool allows you to test if a URL would be matched by any of your configured patterns.
uk: Цей інструмент дозволяє перевірити, чи відповідає URL-адреса будь-якому з шаблонів.

source: Time
uk: Час

source: Total Log Entries
uk: Всього записів у журналі

source: Update Exclude Patterns
uk: Оновити шаблони

source: Update exclude patterns from repository:
uk: Оновити шаблони виключень з репозиторію:

source: Update patterns
uk: Оновити шаблони

source: Update patterns from repository:
uk: Оновлення шаблонів з репозиторію:

source: Updating...
uk: Оновлення...

source: URL Matching Test
uk: Тест на відповідність URL-адреси

source: URL or request pattern:
uk: URL або шаблон запиту:

source: URL pattern to exclude:
uk: Виключити шаблон URL-адреси:

source: URL Variant
uk: Варіант URL-адреси

source: URLs Checked
uk: Перевірені URL-адреси

source: Use exclude patterns to ignore specific URL patterns. For example:
uk: Використовуйте шаблони виключення, щоб ігнорувати певні шаблони URL-адрес. Наприклад:

source: Value
uk: Значення

source: Version
uk: Версія

source: Warning! If this option is enabled, all patterns and settings will be deleted along with the plugin!
uk: Увага! Якщо цей параметр активовано, всі запити та налаштування будуть видалені разом з плагіном!

source: When you enter a URL, the system will:
uk: Коли ви введете URL-адресу, система зробить наступне:

source: write to me in Telegram
uk: написати в Telegram

source: Yes, URL matched one or more patterns
uk: Так, URL-адреса відповідає одному або декільком шаблонам

source: You do not have sufficient permissions to perform this action.
uk: Ви не маєте достатніх прав для виконання цієї дії.

source: Your database is up to date. No new patterns added. %d duplicates skipped.
uk: Ваша база актуальна. Нових шаблонів не додано. Пропущено %d дублікатів.

source: Excluded by Pattern
uk: Виключено за шаблоном

source: URL is excluded by one or more exclude patterns
uk: URL-адреса виключена одним або кількома шаблонами виключення

source: Conclusion:
uk: Висновок:

source: This URL matches your patterns but will NOT be logged due to exclusion rules.
uk: Ця URL-адреса відповідає вашим шаблонам, але НЕ буде логована через правила виключення.

source: This URL does not match any patterns and is also excluded. It will NOT be logged.
uk: Ця URL-адреса не відповідає жодному шаблону і також виключена. Вона НЕ буде логована.

source: URL is not excluded by any patterns
uk: URL-адреса не виключена жодним шаблоном

source: This URL will be logged when accessed.
uk: Ця URL-адреса буде логована при доступі.

source: This URL does not match any patterns. It will NOT be logged.
uk: Ця URL-адреса не відповідає жодному шаблону. Вона НЕ буде логована.

source: Exclude Patterns Matches
uk: Збіги шаблонів виключення

source: Matched Exclude Pattern
uk: Збіг зі шаблоном виключення

source: Matched but excluded
uk: Збіг, але виключено

source: Excluded
uk: Виключено
